In [0]:
import pandas as pd
import numpy as np

In [0]:
newfile=pd.read_csv("https://raw.githubusercontent.com/curtis29/thinkfulworkshop/master/chennai_reservoir_levels.csv")

In [3]:
newfile.head()

         Date  POONDI  CHOLAVARAM  REDHILLS  CHEMBARAMBAKKAM
0  01-01-2004     3.9         0.0     268.0              0.0
1  02-01-2004     3.9         0.0     268.0              0.0
2  03-01-2004     3.9         0.0     267.0              0.0
3  04-01-2004     3.9         0.0     267.0              0.0
4  05-01-2004     3.8         0.0     267.0              0.0

In [4]:
newfile.shape

(5647, 5)